## Plan Result (staging-staging)




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.nle-ext-hmcts-net.azurerm_private_dns_a_record.this[&#34;pcol.db&#34;]
  * module.nle-ext-hmcts-net.azurerm_private_dns_zone.zone[0]
  * module.nle-ext-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-aad-domain-services-mgmt-vnet&#34;]
  * module.nle-ext-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;nle.ext.hmcts.net-vnet-nle-ext-01&#34;]
  * module.nle-int-hmcts-net.azurerm_private_dns_a_record.this[&#34;caps.db&#34;]
  * module.nle-int-hmcts-net.azurerm_private_dns_a_record.this[&#34;cs0663&#34;]
  * module.nle-int-hmcts-net.azurerm_private_dns_a_record.this[&#34;prn001&#34;]
  * module.nle-int-hmcts-net.azurerm_private_dns_zone.zone[0]
  * module.nle-int-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-aad-domain-services-mgmt-vnet&#34;]
  * module.nle-int-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;nle.int.hmcts.net-vnet-nle-ext-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.nle-ext-hmcts-net.azurerm_private_dns_a_record.this["pcol.db"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pcol.db"
      + records             = [
          + "10.25.248.196",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 3600
      + zone_name           = "nle.ext.hmcts.net"
    }

  # module.nle-ext-hmcts-net.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "nle.ext.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.nle-ext-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-aad-domain-services-mgmt-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-aad-domain-services-mgmt-vnet"
      + private_dns_zone_name = "nle.ext.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/core-aad-domain-services-mgmt-rg/providers/Microsoft.Network/virtualNetworks/core-aad-domain-services-mgmt-vnet"
    }

  # module.nle-ext-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["nle.ext.hmcts.net-vnet-nle-ext-01"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "nle.ext.hmcts.net-vnet-nle-ext-01"
      + private_dns_zone_name = "nle.ext.hmcts.net"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_id    = "/subscriptions/9c604868-4643-43b8-9eb1-4c348c739a3e/resourceGroups/ExternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-ext-01"
    }

  # module.nle-int-hmcts-net.azurerm_private_dns_a_record.this["caps.db"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "caps.db"
      + records             = [
          + "10.25.242.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 3600
      + zone_name           = "nle.int.hmcts.net"
    }

  # module.nle-int-hmcts-net.azurerm_private_dns_a_record.this["cs0663"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cs0663"
      + records             = [
          + "10.182.69.16",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 3600
      + zone_name           = "nle.int.hmcts.net"
    }

  # module.nle-int-hmcts-net.azurerm_private_dns_a_record.this["prn001"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prn001"
      + records             = [
          + "10.182.69.19",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 3600
      + zone_name           = "nle.int.hmcts.net"
    }

  # module.nle-int-hmcts-net.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "nle.int.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.nle-int-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-aad-domain-services-mgmt-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-aad-domain-services-mgmt-vnet"
      + private_dns_zone_name = "nle.int.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/core-aad-domain-services-mgmt-rg/providers/Microsoft.Network/virtualNetworks/core-aad-domain-services-mgmt-vnet"
    }

  # module.nle-int-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["nle.int.hmcts.net-vnet-nle-ext-01"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "nle.int.hmcts.net-vnet-nle-ext-01"
      + private_dns_zone_name = "nle.int.hmcts.net"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_id    = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":582,"Program":"tfcmt","SHA1":"","Target":"staging-staging","Vars":{}} -->